const regras = 
`_*LEIA AS REGRAS!*_\n\n
_*1 - É ᴛᴇʀᴍɪɴᴀɴᴛᴇᴍᴇɴᴛᴇ ᴩʀᴏɪʙɪᴅᴏ ᴜꜱᴀʀ ᴏ ʙᴏᴛ ᴩᴀʀᴀ ᴏᴜᴛʀᴏꜱ ꜰɪɴꜱ qᴜᴇ ɴãᴏ ꜱᴇᴊᴀ ʀᴇʟᴇᴠᴀɴᴛᴇ ᴀᴏ ᴄᴏɴᴛᴇúᴅᴏ ᴅᴏ ɢʀᴜᴩᴏ!*_\n
2 - ʀᴇꜱᴩᴇɪᴛᴇ ᴛᴏᴅᴏꜱ ᴏꜱ ᴍᴇᴍʙʀᴏꜱ ᴅᴀ ᴄᴏᴍᴜɴɪᴅᴀᴅᴇ, ɪɴᴅᴇᴩᴇɴᴅᴇɴᴛᴇᴍᴇɴᴛᴇ ᴅᴇ ꜱᴜᴀꜱ ʜᴀʙɪʟɪᴅᴀᴅᴇꜱ, ᴄᴏɴʜᴇᴄɪᴍᴇɴᴛᴏ, ᴅɪᴠᴇʀꜱɪᴅᴀᴅᴇꜱ ᴏᴜ ᴇxᴩᴇʀɪêɴᴄɪᴀ.\n
3 - ᴍᴀɴᴛᴇɴʜᴀ ᴏ ᴄᴏɴᴛᴇúᴅᴏ ʀᴇʟᴇᴠᴀɴᴛᴇ ᴀ ᴩʀᴏɢʀᴀᴍᴀçãᴏ ᴇ ᴛᴇᴄɴᴏʟᴏɢɪᴀ.\n
4 - ꜱᴇᴊᴀ ᴄᴏʟᴀʙᴏʀᴀᴛɪᴠᴏ ᴇ ᴀᴊᴜᴅᴇ ᴏꜱ ᴏᴜᴛʀᴏꜱ ᴀ ʀᴇꜱᴏʟᴠᴇʀ ᴩʀᴏʙʟᴇᴍᴀꜱ ᴇ ᴀᴩʀᴇɴᴅᴇʀ.\n
5 - ɴãᴏ ᴄᴏᴍᴩᴀʀᴛɪʟʜᴇ ᴄóᴅɪɢᴏ ᴄᴏᴍ ᴅɪʀᴇɪᴛᴏꜱ ᴀᴜᴛᴏʀᴀɪꜱ ꜱᴇᴍ ᴩᴇʀᴍɪꜱꜱãᴏ.\n
6 - ɴãᴏ ᴛᴏʟᴇʀᴀᴍᴏꜱ qᴜᴀʟqᴜᴇʀ ᴛɪᴩᴏ ᴅᴇ ᴅɪꜱᴄᴜʀꜱᴏ ᴅᴇ óᴅɪᴏ ᴏᴜ ᴀᴍᴇᴀçᴀꜱ.\n
7 - ᴏꜱ ᴜꜱᴜáʀɪᴏꜱ ꜱãᴏ ʀᴇꜱᴩᴏɴꜱáᴠᴇɪꜱ ᴩᴏʀ ᴍᴀɴᴛᴇʀ ꜱᴜᴀꜱ ᴄᴏɴᴛᴀꜱ ꜱᴇɢᴜʀᴀꜱ ᴇ ɴãᴏ ᴄᴏᴍᴩᴀʀᴛɪʟʜᴀʀ ꜱᴜᴀꜱ ɪɴꜰᴏʀᴍᴀçõᴇꜱ ᴅᴇ ʟᴏɢɪɴ ᴄᴏᴍ ᴛᴇʀᴄᴇɪʀᴏꜱ.\n
8 - ᴀꜱ ʀᴇɢʀᴀꜱ ᴩᴏᴅᴇᴍ ꜱᴇʀ ᴀᴛᴜᴀʟɪᴢᴀᴅᴀꜱ ᴀ qᴜᴀʟqᴜᴇʀ ᴍᴏᴍᴇɴᴛᴏ ᴇ ᴏꜱ ᴜꜱᴜáʀɪᴏꜱ ᴅᴇᴠᴇᴍ ꜱᴇɢᴜɪʀ ᴀꜱ ʀᴇɢʀᴀꜱ ᴍᴀɪꜱ ʀᴇᴄᴇɴᴛᴇꜱ.\n
9 - ᴍᴀɴᴛᴇʀ ᴏ ʙᴏᴍ ꜱᴇɴꜱᴏ ᴇ ᴜꜱᴀʀ ᴀ ᴇᴅᴜᴄᴀçãᴏ ᴇᴍ ᴛᴏᴅᴏꜱ ᴏꜱ ᴍᴏᴍᴇɴᴛᴏꜱ, ᴇᴠɪᴛᴀɴᴅᴏ ᴅɪꜱᴄᴜꜱꜱõᴇꜱ ᴅᴇꜱɴᴇᴄᴇꜱꜱáʀɪᴀꜱ ᴇ ʀᴇꜱᴩᴇɪᴛᴀɴᴅᴏ ᴀꜱ ᴏᴩɪɴɪõᴇꜱ ᴀʟʜᴇɪᴀꜱ.\n
10 - ꜱᴇᴊᴀᴍ ᴀᴛɪᴠᴏꜱ, ʀᴇᴍᴏᴠᴇᴍᴏꜱ ᴩᴇꜱꜱᴏᴀꜱ ɪɴᴀᴛɪᴠᴀꜱ (0 ᴍꜱɢ) ᴀ qᴜᴀʟqᴜᴇʀ ᴍᴏᴍᴇɴᴛᴏ!\n
11 - ɴãᴏ é ᴩᴇʀᴍɪᴛɪᴅᴏ ᴀ ᴠᴇɴᴅᴀ ᴅᴇ ꜱᴇʀᴠɪçᴏꜱ ᴏᴜ ᴩʀᴏᴅᴜᴛᴏꜱ ᴅᴇɴᴛʀᴏ ᴅᴏ ɢʀᴜᴩᴏ, ᴀ ɴãᴏ ꜱᴇʀ qᴜᴇ ꜱᴇᴊᴀ ᴩᴇʀᴍɪᴛɪᴅᴏ ᴩᴇʟᴏꜱ ᴀᴅᴍɪɴɪꜱᴛʀᴀᴅᴏʀᴇꜱ.\n
12 - Qᴜᴀʟqᴜᴇʀ ᴠɪᴏʟᴀçãᴏ ᴅᴀꜱ ʀᴇɢʀᴀꜱ ᴩᴏᴅᴇ ʀᴇꜱᴜʟᴛᴀʀ ᴇᴍ ᴀᴅᴠᴇʀᴛêɴᴄɪᴀ ᴏᴜ ᴇxᴩᴜʟꜱãᴏ ᴅᴏ ɢʀᴜᴩᴏ, ᴀ ᴄʀɪᴛéʀɪᴏ ᴅᴏꜱ ᴀᴅᴍɪɴɪꜱᴛʀᴀᴅᴏʀᴇꜱ.\n
13 - ɴãᴏ ᴩᴜʙʟɪqᴜᴇ ꜱᴩᴀᴍ ᴏᴜ ᴍᴇɴꜱᴀɢᴇɴꜱ ᴄᴏᴍᴇʀᴄɪᴀɪꜱ ɴãᴏ ꜱᴏʟɪᴄɪᴛᴀᴅᴀꜱ ɴᴀ ᴄᴏᴍᴜɴɪᴅᴀᴅᴇ.\n
14 - ɴãᴏ ꜰᴀçᴀ ᴩʀᴏᴩᴀɢᴀɴᴅᴀ ᴅᴇ ᴏᴜᴛʀᴏꜱ ɢʀᴜᴩᴏꜱ ᴏᴜ ᴄᴏᴍᴜɴɪᴅᴀᴅᴇꜱ ꜱᴇᴍ ᴀ ᴩᴇʀᴍɪꜱꜱãᴏ ᴅᴏꜱ ᴀᴅᴍɪɴɪꜱᴛʀᴀᴅᴏʀᴇꜱ.\n
15 - ɴãᴏ ꜰᴀçᴀ ᴜꜱᴏ ɪɴᴅᴇᴠɪᴅᴏ ᴅᴀ ᴄᴏᴍᴜɴɪᴅᴀᴅᴇ ᴩᴀʀᴀ ꜰɪɴꜱ ᴩᴏʟíᴛɪᴄᴏꜱ, ʀᴇʟɪɢɪᴏꜱᴏꜱ ᴏᴜ qᴜᴀʟqᴜᴇʀ ᴏᴜᴛʀᴏ ꜰɪᴍ qᴜᴇ ᴩᴏꜱꜱᴀ ꜱᴇʀ ᴄᴏɴꜱɪᴅᴇʀᴀᴅᴏ ᴏꜰᴇɴꜱɪᴠᴏ ᴏᴜ ᴩʀᴇᴊᴜᴅɪᴄɪᴀʟ ᴀ ᴏᴜᴛʀᴏꜱ ᴍᴇᴍʙʀᴏꜱ.\n
16 - ɴãᴏ ᴄᴏᴍᴩᴀʀᴛɪʟʜᴇ ɪɴꜰᴏʀᴍᴀçõᴇꜱ ᴄᴏɴꜰɪᴅᴇɴᴄɪᴀɪꜱ ᴏᴜ ᴩʀɪᴠᴀᴅᴀꜱ ᴅᴇ ᴏᴜᴛʀᴏꜱ ᴍᴇᴍʙʀᴏꜱ ᴅᴀ ᴄᴏᴍᴜɴɪᴅᴀᴅᴇ ꜱᴇᴍ ᴀ ꜱᴜᴀ ᴩᴇʀᴍɪꜱꜱãᴏ.\n
17 - ᴍᴀɴᴛᴇɴʜᴀ ᴜᴍ ᴄᴏᴍᴩᴏʀᴛᴀᴍᴇɴᴛᴏ ʀᴇꜱᴩᴇɪᴛᴏꜱᴏ ᴇ ᴀᴅᴇqᴜᴀᴅᴏ ᴅᴜʀᴀɴᴛᴇ ᴀꜱ ᴅɪꜱᴄᴜꜱꜱõᴇꜱ ᴏɴʟɪɴᴇ, ᴇᴠɪᴛᴀɴᴅᴏ ʟɪɴɢᴜᴀɢᴇᴍ ᴠᴜʟɢᴀʀ, ᴏꜰᴇɴꜱɪᴠᴀ ᴏᴜ ᴩʀᴇᴊᴜᴅɪᴄɪᴀʟ ᴀ ᴏᴜᴛʀᴏꜱ ᴍᴇᴍʙʀᴏꜱ.\n
18 - ᴄᴀꜱᴏ ᴀʟɢᴜᴇᴍ ᴅᴏ ɢʀᴜᴩᴏ ᴍᴀɴᴅᴇ ᴀʟɢᴏ ʀᴇʟᴀᴄɪᴏɴᴀᴅᴏ ᴀ ᴠᴇɴᴅᴀ/ꜱᴇʀᴠɪçᴏ ɴᴏ ꜱᴇᴜ ᴩʀɪᴠᴀᴅᴏ, ᴠᴏᴄᴇ ᴩᴏᴅᴇ ᴇɴᴛʀᴀʀ ᴇᴍ ᴄᴏɴᴛᴀᴛᴏ ᴄᴏᴍ ᴜᴍ ᴀᴅᴍɪɴɪꜱᴛʀᴀᴅᴏʀ.\n
19 - ᴄᴀꜱᴏ ᴀʟɢᴜᴇᴍ ᴇɴᴠɪᴇ ᴍᴇɴꜱᴀɢᴇᴍ ɴᴏ ɢʀᴜᴩᴏ qᴜᴇ ᴠᴀɪ ᴄᴏɴᴛʀᴀ ᴀʟɢᴜᴍᴀ ʀᴇɢʀᴀ ʙᴀꜱᴛᴀ ᴍᴀʀᴄᴀʀ ᴀʟɢᴜᴍ ᴀᴅᴍɪɴɪꜱᴛʀᴀᴅᴏʀ.
`

export const Regras = async (socket: any, rJid: string, m: any) => {
  await socket.sendMessage(rJid, {
    react: { text: "✅", key: m.messages[0].key },
  });
  try {

    await socket.sendMessage(
      rJid,
      { text: `${regras}` },
      { quoted: m.messages[0] }
    );

  } catch {

    await socket.sendMessage(
      rJid,
      { text: "Erro ao gerar resposta." },
      { quoted: m.messages[0] }
    );

  };
};